/*******************************************************************************
** ÎÄ¼þÃû: 		stm32f10x_it.c
** °æ±¾£º  		1.0
** ¹¤×÷»·¾³: 	RealView MDK-ARM 4.20
** ×÷Õß: 		Îâ¹úÑ×
** Éú³ÉÈÕÆÚ: 	2011-04-10
** ¹¦ÄÜ:		ÖÐ¶ÏÔ´ÎÄ¼þ
** Ïà¹ØÎÄ¼þ:	ÎÞ
** ÐÞ¸ÄÈÕÖ¾£º	2011-04-10   ´´½¨ÎÄµµ
*******************************************************************************/
#include "config.h"
#include "Stm32f10x_gpio.h"
#include "car_speed.h"
#include "car_drive.h"
extern unsigned int tmp;
extern unsigned int SelectTim;

/******************************************************************************/
/*            Cortex-M3 ´¦ÀíÆ÷µÄÏà¹Ø·þÎñº¯Êý                                  */
/******************************************************************************/

/*******************************************************************************
  * @º¯ÊýÃû³Æ	NMI_Handler
  * @º¯ÊýËµÃ÷   ²»¿ÉÆÁ±ÎÖÐ¶Ï·¢ÉúµÄÖÐ¶Ï´¦Àíº¯Êý
  * @ÊäÈë²ÎÊý   ÎÞ
  * @Êä³ö²ÎÊý   Î
  * @·µ»Ø²ÎÊý   ÎÞ
*******************************************************************************/
void NMI_Handler(void)
{
}

/*******************************************************************************
  * @º¯ÊýÃû³Æ	HardFault_Handler
  * @º¯ÊýËµÃ÷   Ó²¼þ´íÎó·¢ÉúµÄÖÐ¶Ï´¦Àíº¯Êý
  * @ÊäÈë²ÎÊý   ÎÞ
  * @Êä³ö²ÎÊý   ÎÞ
  * @·µ»Ø²ÎÊý   ÎÞ
*******************************************************************************/
void HardFault_Handler(void)
{
    //µ±Ó²¼þ´íÎó·¢ÉúÊ±½øÈëËÀÑ­»· 
    while (1)
    {
    }
}

/*******************************************************************************
  * @º¯ÊýÃû³Æ	MemManage_Handler
  * @º¯ÊýËµÃ÷   ÄÚ´æ¹ÜÀíÖÐ¶Ï·¢ÉúµÄÖÐ¶Ï´¦Àíº¯Êý
  * @ÊäÈë²ÎÊý   ÎÞ
  * @Êä³ö²ÎÊý   ÎÞ
  * @·µ»Ø²ÎÊý   ÎÞ
*******************************************************************************/
void MemManage_Handler(void)
{
    //µ±ÄÚ´æ¹ÜÀíÖÐ¶Ï·¢ÉúÊ±½øÈëËÀÑ­»· 
    while (1)
    {
    }
}

/*******************************************************************************
  * @º¯ÊýÃû³Æ	BusFault_Handler
  * @º¯ÊýËµÃ÷   ×ÜÏß´íÎó·¢ÉúµÄÖÐ¶Ï´¦Àíº¯Êý
  * @ÊäÈë²ÎÊý   ÎÞ
  * @Êä³ö²ÎÊý   ÎÞ
  * @·µ»Ø²ÎÊý   ÎÞ
*******************************************************************************/
void BusFault_Handler(void)
{
    //µ±×ÜÏß´íÎó·¢ÉúÊ±½øÈëËÀÑ­»· 
    while (1)
    {
    }
}

/*******************************************************************************
  * @º¯ÊýÃû³Æ	UsageFault_Handler
  * @º¯ÊýËµÃ÷   Usage ´íÎó´íÎó·¢ÉúµÄÖÐ¶Ï´¦Àíº¯Êý
  * @ÊäÈë²ÎÊý   ÎÞ
  * @Êä³ö²ÎÊý   ÎÞ
  * @·µ»Ø²ÎÊý   ÎÞ
*******************************************************************************/
void UsageFault_Handler(void)
{
    //µ±Usage ´íÎó·¢ÉúÊ±½øÈëËÀÑ­»· 
    while (1)
    {
    }
}

/*******************************************************************************
  * @º¯ÊýÃû³Æ	SVC_Handler
  * @º¯ÊýËµÃ÷   SVCµ÷ÓÃÖÐ¶Ï·¢ÉúµÄÖÐ¶Ï´¦Àíº¯Êý
  * @ÊäÈë²ÎÊý   ÎÞ
  * @Êä³ö²ÎÊý   ÎÞ
  * @·µ»Ø²ÎÊý   ÎÞ
*******************************************************************************/
void SVC_Handler(void)
{
}

/*******************************************************************************
  * @º¯ÊýÃû³Æ	DebugMon_Handler
  * @º¯ÊýËµÃ÷   µ÷ÊÔ¼à¿ØÖÐ¶Ï·¢ÉúµÄÖÐ¶Ï´¦Àíº¯Êý
  * @ÊäÈë²ÎÊý   ÎÞ
  * @Êä³ö²ÎÊý   ÎÞ
  * @·µ»Ø²ÎÊý   ÎÞ
*******************************************************************************/
void DebugMon_Handler(void)
{
}

/*******************************************************************************
  * @º¯ÊýÃû³Æ	PendSV_Handler
  * @º¯ÊýËµÃ÷   Pend SVÖÐ¶Ï·¢ÉúµÄÖÐ¶Ï´¦Àíº¯Êý
  * @ÊäÈë²ÎÊý   ÎÞ
  * @Êä³ö²ÎÊý   ÎÞ
  * @·µ»Ø²ÎÊý   ÎÞ
*******************************************************************************/
void PendSV_Handler(void)
{
}




void TIM2_IRQHandler(void)  
{	   
		 TIM_ClearFlag(TIM2, TIM_FLAG_Update);   
			SelectTim++;
		if(SelectTim>=10){
			SelectDir++;
			SelectTim = 0;
		}
			Car_SelectSignal();
}          


/******************************************************************************/
/*                 STM32F10x ÍâÉè ÖÐ¶Ï ·þÎñº¯Êý                               */
/*  Ôö¼ÓÐèÒªµÄÍâÉèÖÐ¶Ïº¯ÊýÔÚÏÂÃæ¡£ÖÐ¶ÏµÄº¯ÊýÃû×Ö¶¼ÒÑ¾­ÔÚstartup_stm32f10x_xx.s*/
/*  µÄÎÄ¼þÖÐ¶¨ÒåºÃÁË£¬Çë²ÎÕÕËüÀ´Ð´¡£                                          */
/******************************************************************************/


//ÓÃ»§Ôö¼Ó×Ô¼ºµÄÖÐ¶Ï·þÎñ³ÌÐòÕâÏÂÃæ¡£

/***********************************ÎÄ¼þ½áÊø***********************************/
